{"data":{"site":{"siteMetadata":{"title":"Out of Office Email Generator","tagline":"Because taking vacation should be fun."}},"allMarkdownRemark":{"edges":[{"node":{"rawMarkdownBody":"\nI really can’t stay… (because I’m out of office right now.)\nI gotta go away… (I’ll be gone from [Leave Date] to [Return Date])\nThis evening has been so very nice… (in [Destination])\nMaybe it’s cold outside….(wherever you are right now.)\nBut really I’d better scurry… (and get to my [Activity].) \nAnd if you start to worry… (contact [ER Contact Name])\nBut only if you’re pacing the floor… (email them at [ER Contact Email])\nI simply must go… (But I’ll respond when I return.)\nAnd if it’s cold outside…. Enjoy this rendition of Michael Buble’s Baby It’s Cold Outside (https://www.youtube.com/watch?v=6bbuBubZ1yE)\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nSeason’s Greetings!\n\nI was hoping that our engineers could somehow transport the smell of freshly baked pie and my grandmother’s baked cookies through the computer, but they told me they had more important things to build (sigh). \n\nThat’s right, I am out of the office until [Return Date] doing all winter activities you could think of. If this is urgent, please reach out to [ER Contact Name] at [ER Contact Email] and they can direct you. If you try and tweet or ping me another way, you may not get a delivery of my special cookies when I return (just sayin’). \n\nHappy Holidays! \n[First Name] \n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHello, \n\nI know you may be upset that I’m on vacation in [Destination] until [Return Date] and you’re not. I don’t blame you, or discount your feelings. But, let’s be real for a second. Everyone knows that the holiday season in the office means daily baked goods, wearing ridiculous ugly sweaters that jingle, swapping gifts, and listening to the best tunes of the season. So, bring some cheer to the office while I’m out, and enjoy these top seasonal hits for a quick escape to a winter wonderland: \n\nLet it Snow! Let it Snow! Let it Snow!, Frank Sinatra\nBaby It's Cold Outside, Idina Menzel & Michael Bublé \nWinter Wonderland, Elvis Presley \nDecember '63, The Four Seasons (Okay, not really a winter song, but it’s a great one) \nIce, Ice Baby, Vanilla Ice (I know, it’s a stretch, but had to) \n\nWhen the music stops (figuratively and literally), email [ER Contact Name] at [ER Contact Email] for a timely reply.\n\nCheers! \n[First Name] \n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHello! Guess what, it’s Trivia Time: \n\nQ1: Where’s [First Name]?\n  1. Out on vacation in [Destination]\n  2. Singing carols around the neighborhood\n  3. In the North Pole \nQ2: When will [First Name] be back?\n  1. When the reindeer get their act together and can bring them home\n  2. When winter is over \n  3. [Return Date]\nQ3: Is [First Name] sorry to miss your email?\n  1. So … so … sorry\n  2. Eh.\n  3. No comment.\nQ4: Who should you contact in case of an emergency?\n  1.Frosty the Snowman\n  2.[ER Contact Name] at [ER Contact Email]\n  3.The Grinch\n\nAnswers: 1, 3, 1, 2\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nSeason’s Greetings!\n\nI am currently curled up on the couch with fuzzy slippers on and a mug of hot cocoa in hand. There’s a fire playing on my TV and I’m [Activity]. It’s safe to say, I won’t be getting up to answer your email, question on Slack, or saying yes to your calendar invite until [Return Date]. \n\nIf it’s an emergency - like the colored lights won’t turn on, or you forgot your shovel outside before it began to snow, tweet me using the hashtag #SureFeelsLikeTheHolidays and I’ll respond with some quick, actionable tips. \n\nIf your emergency has to do with work, please reach out to the esteemed [ER Contact Name] at [ER Contact Email] or I’ll get back to you once I return to the office (potentially with my fuzzy slippers still on). \n\nCheers!\n[First Name] [Last Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nSeason’s Greetings!\n\nYou’ve reached [First Name]’s inbox. They’re out of the office from [Leave Date] until [Return Date] while in [Destination] enjoying [Activity]. But, before you click “move to trash,” give the #HolidayBot a chance to share a helpful tip for the season. \n\nIf your calendar looks like [First Name]’s, you may have a handful of holiday parties you don’t remember RSVP’ing “yes” to. If that is the case, you’ll want to reconsider the present that oftentimes is overlooked as the laughing stock of gift giving: the fruitcake. \n\nHere’s a modern-day fruitcake recipe that I think will wow guests. And if you hear a giggle in the crowd, don’t hold back on mentioning that this is one of the only desserts that can last up to 6 months. That means it’s not just a miracle, but also an economically friendly present guests should jump for joy over. \n\nIf your email isn’t about the myths and misconceptions of the fruitcake, I really can’t help you. You’ll have to either ask [ER Contact Name] at [ER Contact Email] or wait until [First Name] returns. \n\nGood luck with baking!\n#HolidayBot\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHello,\n\nYou’ve reached the inbox of [First Name] [Last Name]. They’re unable to respond to your email right now because they’re currently in the thick of holiday shopping. And, if you’ve ever seen Love Actually, you know how long gift wrapping can take (https://www.youtube.com/watch?v=E3rB_qx0wRM), so [First Name] won’t be back until [Return Date]. Until they return from the nightmare of Toyland, give [ER Contact Name] a jingle at [ER Contact Email]. \n\nHappy Holidays! \n[First Name] [Last Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nSnow day! Snow day! We have a snow day!\n\nWhile kids are outside building snowmen and sledding, I will be shoveling out of our wintery fortress and [Activity]. Who knows how long the task will take, but you can expect me to be gone from [Leave Date] until [Return Date]. \n\nIn case of emergency (other than this snow emergency), please email [ER Contact Name] at [ER Contact Email]. \n\nFrom the inside of a snowglobe, \n[First Name] [Last Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\n‘Tis the season for receiving an out of office email. But instead of the generic “limited access to wifi” message (hello, it’s the 21st century) I thought I’d share my holiday plans with you because if we just so happen to be friends on Facebook, you’ll probably be seeing the photos I post with all the wifi I have anyways.\n\nI’ll be enjoying the holidays this year in [Destination] starting [Leave Date]. While I’m here, I’ll be [Activity] with my loved ones during this magical time of year. \n\nIf this is an emergency and can’t wait until I return on [Return Date], please email [ER Contact Name] at [ER Contact Email], although chances are they are spending time with friends and family as well, and I hope you can do the same. \n\nYou can most likely expect a response from me...next year. (That joke never gets old to me.)\n\nHave a wonderful holiday season,\n[First Name] [Last Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHello, it’s me. I’ve been wondering if after all these emails you’d like to meet. To go over, everything. They say the holidays are meant to chill you out, but I ain’t done much chillin’.\n\nHello, can you hear me? I’m in [Destination] until [Return Date] dreaming about the most wonderful time of year. Even if you call a thousand times, I won’t be answering as I will be busy doing [Activity]. \n\nAt least you can say you’ve tried. \n\nIf this is urgent, please try [ER Contact Name] at [ER Contact Email]. \n\nGoodbye from the other side. \n[First Name] \n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHello, \n\nDid you know that the most common New Year’s resolution is to exercise more? Lucky for me, I’m anything but common. I actually plan to exercise less next year, starting right now. \n\nI’m currently out of office from [Leave Date] to [Return Date] in [Destination]. And there’s a lot to do in [Destination], but I’m most interested in cozying up on the couch, enjoying some hot cocoa (with whole milk!), and [Activity]. \n\nWhy? Because my New Year’s resolution this year is YOLO.\n\nWhat’s yours? (Wait, don’t tell me, you’ll get another autoresponder.)\n\nI’ll follow up when I’m back, and if you need quick help, please reach out to [ER Contact Name] at [ER Contact Email]. \n\nHave a happy holiday season!\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nOh hello there, \n\nIt seems you’ve reached me at a bad time. See, I’m away from the office in [Destination] from [Leave Date] until [Return Date]. And because it’s nearing the end of another year, I’m doing a lot of reflecting while I’m away. \n\nFor example, I really regret not taking more time off this year. Vacation is good for the soul, but there’s just never a good time to take it. I guess that’s why over 700 million vacation days went unused in the U.S. in 2017. That’s right, MILLION.\n\nThat’s why I’m using this time in [Destination] for unplugging, relaxing, and [Activity]. (Oh and listening to holiday music, of course.) \n\nIf your message is urgent, please reach out to [ER Contact Name] at [ER Contact Email]. \nHappy unplugging!\n[First Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHi there, thanks for your email. Unfortunately (or not, if you’re me), I’m on vacation from [Leave Date] until [Return Date]. And before you get jealous, I have something that will help your office blues. Please enjoy this 10-hour video loop of a crackling fireplace: https://www.youtube.com/watch?v=ZY3J3Y_OU0w\n\nIf that doesn’t put you in the holiday spirit (or to sleep), I don’t what will.\n\nIn case your message is urgent, please contact [ER Contact Name] at [ER Contact Email]. \nAll the best!\n[First Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHi there,\n\nI’m out of the office from [Leave Date] until [Return Date] in [Destination] doing nothing but [Activity].  \n\nBut I have to admit, your email caught me off guard. It’s the holiday season, after all. Offices are empty. Desks are collecting dust. Mail is building up. Personally, I’m not sure I’d know how to use Excel right now if it hit me in the face. \n\nAlas, you’re a hard worker. (Or hopefully, you have a big, long, relaxing vacation right around the corner.) So if you need a response sooner than later, please reach out to [ER Contact Name] at [ER Contact Email].\n\nHappy holidays!\n[First Name]\n","frontmatter":{"theme":"holiday"}}},{"node":{"rawMarkdownBody":"\nHi, you’ve reached [First Name][last name]’s ghost of vacations past. I’ll make sure your email gets read and responded to when they’re back at work on [Return Date]. But for now, it’s my job to make sure they unplug while they’re away in [Destination]. After all, a history of unrelaxing vacations can be a scary thing.\n\nIf it’s urgent, reach out to [ER Contact Name] at [ER Contact Email] - I’m not scheduled to haunt them until later this year. Thank you and have a boo-tiful day!\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nHonestly, I don’t know how I got here in [Destination]. One minute I’m in the conference room listening to Jane go over technical requirements, and the next I find myself [Activity], drinking something fizzy out of a pineapple. Supposedly, I won’t be back until [Return Date]. Please email [ER Contact Name] at [ER Contact Email] if you need a quick response.\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nHi there, thanks for your email. Unfortunately (or not, if you’re me), I’m on vacation in [Destination] until [Return Date]. And before you get jealous, I have something that will help your office blues. Please enjoy this relaxing, 10-hour YouTube video of ocean waves. You’ll feel like you’re on the sandy beaches of Hawaii! https://www.youtube.com/watch?v=WHPEKLQID4U\n\nIn case your message is urgent, please contact [ER Contact Name] at [ER Contact Email].\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nHi there, I’m in [Destination] until [Return Date]. If it’s important, tweet me using the hashtag #YoureRuiningMyHoliday\n\n(Alternatively, email [ER Contact Name] at [ER Contact Email])\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nOnce upon a time, [First Name] discovered a magical land called vacation. It only lasted from [Leave Date] to [Return Date], but not a moment was wasted in this Kingdom free of Powerpoint and watercooler talk. Vacation land was filled with sleeping, eating, and [Activity]. And, there were no emails to worry about because the urgent, timely ones were sent to [ER Contact Email].\n\nPicture the peaceful vacation Kingdom. Now, go: Start planning your own enchanted journey.\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nThanks for your email. Unfortunately, I won’t be able to read it or think about it until [Return Date] when I’m back from my vacation in [Destination]. In the meantime, I’ll be using that brain power to think about:\n- A witty caption for my upcoming feet-in-the-sand Instagram post\n- If the couple from the Piña Coladas song ended up together in the end\n- The perfect gift to bring back to [ER Contact Name], who you should email if you need a timely response at [ER Contact Email]\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nOkay okay, I know what you might be thinking. \n\n[First Name]’s on vacation and I’m not. You might be jealous, or even angry. And I don’t blame you. I’m in [Destination] until [Return Date], doing nothing but [Activity], while you’re probably preparing for a big meeting or writing a project summary. \n\nBut mind over matter, my friend. Book a conference room, put on your headphones, close your eyes, and enjoy these top summer hits for a quick escape:\n- Summer Looks Good On You, Cheap Trick\n- Kokomo, Beach Boys\n- Summer Girls, LFO\n- Paradise City, Guns N’ Roses\n- Walking on Sunshine, Katrina & The Waves\n\nWhen the music stops (figuratively and literally), email [ER Contact Name] at [ER Contact Email] for a timely reply.\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nOh, this is awkward: You’ve caught me away from my desk. *The crowd gasps*.\n\nI’m in [Destination] until [Return Date], and I know I’m supposed to say I have limited access to email but the truth is, the WiFi works just fine here #SorryNotSorry. I’m just focusing on [Activity] instead of my inbox. Once I’m back from my holiday, I look forward to embracing WiFi again and following up with you. (After the post-vacation blues, of course.) \n\nIf someone is really, truly, desperately urgent, please reach out to [ER Contact Name] at [ER Contact Email]. Thanks!\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nHello, it looks like you’ve reached the inbox of [First Name] [Last Name]. I’m afraid [First Name] can’t come to their desk right now. Why? Because they are busy [Activity] in [Destination]. Please leave your message (oh wait, you’ve done that) and they’ll get back to you as soon as they can. In case of an emergency, please dial 1-800-[ER Contact Name] at [ER Contact Email].\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nDid you know that most people in the US only use about 51% of their paid time off? \n\nWell, I am not most people. I give everything 100%. EVERYTHING. Work, friends, family, my Netflix shows, you name it. And I plan to give my vacation days 100% which is why I’m on vacation in [Destination] until [Return Date]. If you need me before then, I’m sorry but I’ll be 100% dedicated to [Activity]. \n\nFeel free to reach out to [ER Contact Name] at [ER Contact Email] if it’s an emergency. Thank you, and as always, keep it 100. \n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nHi there, thanks for your email!\n\nI’m out of office until [Return Date], in [Destination] enjoying [Activity]. I’ll follow up with you as soon as I can when I’m back at work. In case of an emergency*, please email [ER Contact Name] at [ER Contact Email]. \n\nHave a great day,\n[First Name]\n\n*Emergency can be defined as:\n- ‘The Bachelorette’ returned my phone call and they LOVED my audition tape\n- They’ve replaced salted almonds with unsalted almonds (i.e. no salt) in the office kitchen\n- I was tagged in an unflattering photo on Facebook\n- You won the lottery and need someone to split the winnings with because it’s simply too much money for one person\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nIf you’re reading this email, I thank you for coming this far. Now, I’d like to invite you to go a little further…. \n\nIf you need to reach me, travel to [Destination] where I’ll be on vacation until [Return Date]. There, on the highest peak, of the tallest mountain, you’ll find a small house with a red door. Open the door. Inside the house, you’ll meet a kind, old man who will give you a flower. When you understand that flower, you’ll know how to truly reach me. \n\nFor those of you not willing to take the journey, please wait until my return or email [ER Contact Name] at [ER Contact Email].\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nHello, it’s me, vacation-[First Name]. \n\nPeople often confuse me and [First Name], but we are actually quite different. [First Name] proofreads everything...twice. Vacation-[First Name] proofreads murder mystery novels and cooking magazines. [First Name] worries about deadlines. Vacation-[First Name] worries about squeezing a nap in before dinner. [First Name] gets nervous about speaking up in a meeting. Vacation-[First Name] gets nervous the karaoke machine will run out of songs. \n\nI’ll be back to my old self on [Return Date], but for now, vacation-[First Name] is running the show in [Destination]. If your message is timely, reach out to [ER Contact Name] at [ER Contact Email].\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nTrivia Time\nQ1: Where’s [First Name]?\n  1. Out on vacation in [Destination]\n  2. Right behind you\n  3. Space\nQ2: When will [First Name] be back?\n  1. When hell freezes over gets a remake\n  2. Infinity + Never\n  3. [Return Date]\nQ3: Is [First Name] sorry to miss your email?\n  1. So … so … sorry\n  2. Eh.\n  3. No comment.\nQ4: Who should you contact in case of an emergency?\n  1. Your local pizza delivery joint\n  2. [ER Contact Name] at [ER Contact Email]\n  3. Justin Bieber\n\nAnswers: 1, 3, 1, 2\n","frontmatter":{"theme":"summer"}}},{"node":{"rawMarkdownBody":"\nClose your eyes. Breathe in. Breathe out. Picture yourself in the happiest place you can imagine. A gentle breeze tickles your nose hairs. You're getting a massage while a family of bunnies hum Here Comes the Sun. The sun pours sweet, sweet nectar into your mouth. A butterfly whispers, “There is no meeting. There are no spreadsheets” over and over into your ear.\n\nNow replace you with me. And I’ll be there until [Return Date]. \n\nIf your message is urgent, please email [ER Contact Name] at [ER Contact Email]. \n","frontmatter":{"theme":"summer"}}}]}},"pageContext":{}}